In [2]:
from moz_sql_parser import parse
#from sql_formatter import format
import json

In [3]:
# encoding: utf-8
#
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this file,
# You can obtain one at http://mozilla.org/MPL/2.0/.
#
# Author: Beto Dealmeida (beto@dealmeida.net)
#

from __future__ import absolute_import
from __future__ import division
from __future__ import unicode_literals

import re

from mo_future import string_types, text, first, long, is_text
import random

from sql_formatter.keywords import RESERVED, reserved_keywords, join_keywords, precedence, binary_ops

VALID = re.compile(r'^[a-zA-Z_]\w*$')

alias = {"*" : "all items"}

op_dict = {
    '||' : 'concatenated with',
    '*' : 'multiply by',
    '/' : 'divide',
    '%' : 'modulo',
    '+' : 'add',
    '-' : 'minus',
    '<>': 'not equal to',
    '>' : 'greater than',
    '<' : 'less than',
    '>=': 'greater than or equal to',
    '<=': 'less than or equal to',
    '=' : 'equal to',
    'or': 'or',
    'and' : 'and',
    "&" : 'binary and',
    "|" : 'binary or'
}

func_dict = {
    'AVG' : 'the average of',
    'COUNT' : 'the number of',
    'MAX' : 'the maximum of',
    'MIN' : 'the minimum of',
    'SUM' : 'the sum of',
    'ASC' : 'in ascending order',
    'DESC' : 'in descending order',
    'DISTINCT': 'distinct'
}

def should_quote(identifier):
    """
    Return true if a given identifier should be quoted.

    This is usually true when the identifier:

      - is a reserved word
      - contain spaces
      - does not match the regex `[a-zA-Z_]\\w*`

    """
    return (
        identifier != '*' and (
            not VALID.match(identifier) or identifier in reserved_keywords))


def split_field(field):
    """
    RETURN field AS ARRAY OF DOT-SEPARATED FIELDS
    """
    if field == "." or field==None:
        return []
    elif is_text(field) and "." in field:
        if field.startswith(".."):
            remainder = field.lstrip(".")
            back = len(field) - len(remainder) - 1
            return [-1]*back + [k.replace("\a", ".") for k in remainder.replace("\\.", "\a").split(".")]
        else:
            return [k.replace("\a", ".") for k in field.replace("\\.", "\a").split(".")]
    else:
        return [field]


def join_field(path):
    """
    RETURN field SEQUENCE AS STRING
    """
    output = ".".join([f.replace(".", "\\.") for f in path if f != None])
    return output if output else "."

    # potent = [f for f in path if f != "."]
    # if not potent:
    #     return "."
    # return ".".join([f.replace(".", "\\.") for f in potent])



def escape(ident, ansi_quotes, should_quote):
    """
    Escape identifiers.

    ANSI uses single quotes, but many databases use back quotes.

    """
    def esc(identifier):
        if not should_quote(identifier):
            return identifier

        quote = '"' if ansi_quotes else '`'
        identifier = identifier.replace(quote, 2*quote)
        return '{0}{1}{2}'.format(quote, identifier, quote)
    return join_field(esc(f) for f in split_field(ident))


def Operator(op):
    prec = precedence[binary_ops[op]]
    op = ' {0} '.format(op).upper()

    def func(self, json):
        acc = []

        for v in json:
            sql = self.dispatch(v)
            sql = self.process_value(sql)
            if isinstance(v, (text, int, float, long)):
                acc.append(sql)
                continue

            p = precedence.get(first(v.keys()))
            if p is None:
                acc.append(sql)
                continue
            if p>=prec:
                acc.append("(" + sql + ")")
            else:
                acc.append(sql)
        return op.join(acc)
    return func


class Formatter:

    clauses = [
        'with_',
        'select',
        'from_',
        'where',
        'groupby',
        'having',
        'orderby',
        'limit',
        'offset',
    ]

    # simple operators
    _concat = Operator('||')
    _mul = Operator('*')
    _div = Operator('/')
    _mod = Operator('%')
    _add = Operator('+')
    _sub = Operator('-')
    _neq = Operator('<>')
    _gt = Operator('>')
    _lt = Operator('<')
    _gte = Operator('>=')
    _lte = Operator('<=')
    _eq = Operator('=')
    _or = Operator('or')
    _and = Operator('and')
    _binary_and = Operator("&")
    _binary_or = Operator("|")

    def __init__(self, ansi_quotes=True, should_quote=should_quote):
        self.ansi_quotes = ansi_quotes
        self.should_quote = should_quote

    def format(self, json):
        preprocessed_sql = ''
        if 'union' in json:
            sql = self.union(json['union'])
        elif 'union_all' in json:
            sql = self.union_all(json['union_all'])
        else:
            sql = self.query(json)
        
        preprocessed_sql = self.preprocess(sql)
        return preprocessed_sql
    
    def preprocess(self, sql):
        preprocessed_sql = []
        for tok in sql.split():
            if tok in alias:
                new_tok = alias[tok]
            elif tok in op_dict:
                new_tok = op_dict[tok]
            elif tok in func_dict:
                new_tok = func_dict[tok]
            else:
                new_tok = tok
            preprocessed_sql += [new_tok]

        preprocessed_sql = ' '.join(preprocessed_sql).lower()
        return preprocessed_sql

    def dispatch(self, json):
        if isinstance(json, list):
            return self.delimited_list(json)
        if isinstance(json, dict):
            if len(json) == 0:
                return ''
            elif 'value' in json:
                return " {} ".format(self.value(json))
            elif 'from' in json:
                # Nested queries
                return '( {} )'.format(self.format(json))
            elif 'select' in json:
                # Nested queries
                return '( {} )'.format(self.format(json))
            else:
                return self.op(json).replace('\"', '')
        if isinstance(json, string_types):
            return escape(json, self.ansi_quotes, self.should_quote)

        return text(json)

    def delimited_list(self, json):
        return ' , '.join(self.dispatch(element) for element in json)

    def process_value(self, value):
        value = str(value)
        if '.' in value and '(' not in value and "\"" not in value and "\'" not in value:
            tab, col = value.split('.')
            value = col + ' of ' + tab

        value = value.replace('_', ' ')
        value = "( " + value + " )"
        return value
    
    def value(self, json):
        if 'name' in json and self.dispatch(json['name']) not in alias:
            alias[self.dispatch(json['name'])] = self.dispatch(json['value']).replace('_', ' ')
        
        value = self.dispatch(json['value'])
        
        value = self.process_value(value)
        
        parts = [value]
        return ' '.join(parts)
    

    def op(self, json):
        if 'on' in json:
            return self._on(json)

        if len(json) > 1:
            raise Exception('Operators should have only one key!')
        key, value = list(json.items())[0]
        
        # check if the attribute exists, and call the corresponding method;
        # note that we disallow keys that start with `_` to avoid giving access
        # to magic methods
        attr = '_{0}'.format(key)
        if hasattr(self, attr) and not key.startswith('_'):
            method = getattr(self, attr)
            return method(value)
        
        value = self.dispatch(value)
        if isinstance(value, list):
            value = [self.process_value(val) for val in value]
        else:
            value = self.process_value(value)
        
        key = key.upper()

        # treat as regular function call
        return '{0}  {1}  '.format(key, value)

    def _binary_not(self, value):
        return 'not ( {0} )'.format(self.dispatch(value))

    def _exists(self, value):
        return '( {0} ) is existed '.format(self.dispatch(value))

    def _missing(self, value):
        return '( {0} ) is missing'.format(self.dispatch(value))

    def _like(self, pair):
        return '( {0} ) like ( {1} )'.format(self.dispatch(pair[0]), self.dispatch(pair[1]))

    def _nlike(self, pair):
        return '( {0} ) not like ( {1} )'.format(self.dispatch(pair[0]), self.dispatch(pair[1]))

    def _is(self, pair):
        return '( {0} ) is ( {1} )'.format(self.dispatch(pair[0]), self.dispatch(pair[1]))

    def _in(self, json):
        valid = self.dispatch(json[1])
        # `(10, 11, 12)` does not get parsed as literal, so it's formatted as
        # `10, 11, 12`. This fixes it.
        if not valid.startswith('('):
            valid = '( {0} )'.format(valid)

        return '( {0} ) in ( {1} )'.format(json[0], valid)

    def _nin(self, json):
        valid = self.dispatch(json[1])
        # `(10, 11, 12)` does not get parsed as literal, so it's formatted as
        # `10, 11, 12`. This fixes it.
        if not valid.startswith('('):
            valid = '( {0} )'.format(valid)

        return '( {0} ) not in ( {1} )'.format(json[0], valid)

    def _case(self, checks):
        parts = ['case']
        for check in checks:
            if isinstance(check, dict):
                if 'when' in check and 'then' in check:
                    parts.extend(['when', self.dispatch(check['when'])])
                    parts.extend(['then', self.dispatch(check['then'])])
                else:
                    parts.extend(['else', self.dispatch(check)])
            else:
                parts.extend(['else', self.dispatch(check)])
        parts.append('end')
        return ' '.join(parts)

    def _literal(self, json):

        if isinstance(json, list):
            return '( {0} )'.format(', '.join(self._literal(v) for v in json))
        elif isinstance(json, string_types):
            return "'{0}'".format(json.replace("'", "''"))
        else:
            return "the literal value ( {} )".format(json['literal'])

    def _between(self, json):
        return '( {0} ) between ( {1} ) and ( {2} )'.format(self.dispatch(json[0]), self.dispatch(json[1]), self.dispatch(json[2]))

    def _not_between(self, json):
        return '( {0} ) not between ( {1} ) and ( {2} )'.format(self.dispatch(json[0]), self.dispatch(json[1]), self.dispatch(json[2]))

    def _on(self, json):
        detected_join = join_keywords & set(json.keys())
        if len(detected_join) == 0:
            raise Exception(
                'Fail to detect join type! Detected: "{}" Except one of: "{}"'.format(
                    [on_keyword for on_keyword in json if on_keyword != 'on'][0],
                    '", "'.join(join_keywords)
                )
            )

        join_keyword = detected_join.pop()

        return ' {0} ( {1}  satisfied that ( {2} ) )'.format(
            ', and', self.dispatch(json[join_keyword]), self.dispatch(json['on'])
        )

    def union(self, json):
        return ' and '.join(self.query(query) for query in json)

    def union_all(self, json):
        return ' all '.join(self.query(query) for query in json)

    def query(self, json):
        return ' '.join(
            part
            for clause in self.clauses
            for part in [getattr(self, clause)(json)]
            if part
        )

    def with_(self, json):
        if 'with' in json:
            with_ = json['with']
            if not isinstance(with_, list):
                with_ = [with_]
            
            if part['name'] not in alias:
                alias[part['name']] = self.dispatch(json['value']).replace('_', ' ')
            
            parts = ', '.join(
                '{0}'.format(self.dispatch(part['value'])).replace('_', ' ')
                for part in with_
            )
            return 'with  {0} '.format(parts)

    def select(self, json):
        if 'select' in json:
            return ' {0} '.format(self.dispatch(json['select']))

    def from_(self, json):
        is_join = False
        if 'from' in json:
            from_ = json['from']
            if 'union' in from_:
                return self.union(from_['union'])
            if not isinstance(from_, list):
                from_ = [from_]

            parts = []
            for token in from_:
                if join_keywords & set(token):
                    is_join = True
                parts.append(self.dispatch(token))
            joiner = ' ' if is_join else ', '
            rest = joiner.join(parts).replace("_", " ")
            return 'that belongs to ( {0} ) '.format(rest)

    def where(self, json):
        if 'where' in json:
            return ', that have  ( {0} ) '.format(self.dispatch(json['where']))

    def groupby(self, json):
        if 'groupby' in json:
            return ', grouped by {0} '.format(self.dispatch(json['groupby']))

    def having(self, json):
        if 'having' in json:
            return ', that have  ( {0} ) '.format(self.dispatch(json['having']))

    def orderby(self, json):
        if 'orderby' in json:
            orderby = json['orderby']
            if isinstance(orderby, dict):
                orderby = [orderby]
            return ', ordered by ( {0} )'.format(','.join([
                '{0} {1}'.format(self.dispatch(o), o.get('sort', '').upper()).strip()
                for o in orderby
            ]))

    def limit(self, json):
        if 'limit' in json:
            if json['limit']:
                return ', limited to the top ( {0} )'.format(self.dispatch(json['limit']))

    def offset(self, json):
        if 'offset' in json:
            return ', that have offset ( {0} ) '.format(self.dispatch(json['offset']))

In [4]:
def translate_sql(sql):
    formatter = Formatter()

    if sql.split()[0] == '\"l' and sql.split()[-1] == 'r\"':
        print("2:", sql)
        translated_struct_sql = sql.replace('\"l','(').replace('r\"',')')
        print("2:", translated_struct_sql)
        translated_sql = ' '.join(translated_struct_sql.replace('(','').replace(')','').split())
        return translated_sql, translated_struct_sql
    
    if " (SELECT " in sql or " ( SELECT " in sql:
        if " (SELECT " in sql:
            start_pos = sql.index("(SELECT") + 1
        if " ( SELECT " in sql:
            start_pos = sql.index("( SELECT") + 1
        parenthesis = ['(']
        clause_len = len(sql[start_pos:])
        for i, char in enumerate(sql[start_pos:]):
            if char == ')':
                parenthesis.pop()
                if not parenthesis:
                    clause_len = i
                    break
            elif char == '(':
                parenthesis.append(char)
        
        sub_sql = sql[start_pos : start_pos + clause_len]
        
        #print('sub_sql', sub_sql)

        translated_sub_sql = "\"l {} r\"".format(translate_sql(sub_sql)[1])
        
        sql = sql[ : start_pos - 1] + translated_sub_sql + sql[start_pos + clause_len + 1:]
        
        _, translated_struct_sql = translate_sql(sql)
        translated_struct_sql = translated_struct_sql.replace('( l ','').replace(' r )','')
        translated_sql = ' '.join(translated_struct_sql.replace('(','').replace(')','').split())
        return translated_sql, translated_struct_sql
    
    if " EXCEPT " in sql:
        translated_sqls = []
        translated_struct_sqls = []
        sqls = sql.split(" EXCEPT ")
        for index, statement in enumerate(sqls):
            translated_sql, translated_struct_sql = translate_sql(statement)
            translated_sqls.append(translated_sql)
            if index > 0:
                translated_struct_sql = "( " + translated_struct_sql + ")"
            translated_struct_sqls.append(translated_struct_sql)
        
        translated_sql = ', and except that '.join(translated_sqls)
        translated_struct_sql = ', and except that '.join(translated_struct_sqls)
        return translated_sql, translated_struct_sql   
    if " INTERSECT " in sql:
        translated_sqls = []
        translated_struct_sqls = []
        sqls = sql.split(" INTERSECT ")
        for index, statement in enumerate(sqls):
            translated_sql, translated_struct_sql = translate_sql(statement)
            translated_sqls.append(translated_sql)
            if index > 0:
                translated_struct_sql = "( " + translated_struct_sql + ")"
            translated_struct_sqls.append(translated_struct_sql)
        
        translated_sql = ', and intersect with '.join(translated_sqls)
        translated_struct_sql = ', and intersect with '.join(translated_struct_sqls)
        return translated_sql, translated_struct_sql     

    stmt = parse(sql)
    translated_struct_sql = formatter.format(stmt)
    try:
        stmt = parse(sql)
        translated_struct_sql = formatter.format(stmt)
    except Exception as e:
        print("Error:", e, '\n')
        print("Error:", sql, '\n')
        translated_struct_sql = formatter.preprocess(sql)

    translated_sql = ' '.join(translated_struct_sql.replace('(','').replace(')','').split())
    return translated_sql, translated_struct_sql

In [6]:
sql = "SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  2"
print(op_dict.keys(), func_dict.keys(),'\n----------------------------------')
print(sql,'\n----------------------------------')
translated_sql, translated_struct_sql = translate_sql(sql)
print(translated_sql, '\n----------------------------------\n', translated_struct_sql)

dict_keys(['||', '*', '/', '%', '+', '-', '<>', '>', '<', '>=', '<=', '=', 'or', 'and', '&', '|']) dict_keys(['AVG', 'COUNT', 'MAX', 'MIN', 'SUM', 'ASC', 'DESC', 'DISTINCT'])
----------------------------------
SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  2
----------------------------------
name of highschooler that belongs to likes , and highschooler satisfied that student id of likes equal to id of highschooler , grouped by student id of likes , that have the number of all items greater than or equal to 2
----------------------------------
 ( name of highschooler ) that belongs to ( ( likes ) , and ( ( highschooler ) satisfied that ( ( student id of likes ) equal to ( id of highschooler ) ) ) ) , grouped by ( student id of likes ) , that have ( ( the number of ( all items ) ) greater than or equal to ( 2 ) )

In [4]:
with open("/ai/conceptflow/data/examples/semantic-parsing/text-to-sql/spider/spider/train.json") as train:
    train_data = json.load(train)
    with open('/ai/conceptflow/relogic-semparse/data/spider/preprocessed_train.json', 'w') as output_file:
        for i, example in enumerate(train_data):
            if i % 100 == 0:
                print ('Preprocessed {0} examples'.format(i))
            sql = example['query'].strip(';')
            question = example['question']
            
            #print(sql)
            
            translated_sql, translated_struct_sql = translate_sql(sql)
                
            data = {
                "sql" : sql,
                "translated_sql" : translated_sql,
                "translated_struct_sql" : translated_struct_sql,
                "question" : question
            }
            
            output_file.write(json.dumps(data) + '\n')

Preprocessed 0 examples
Preprocessed 100 examples
Preprocessed 200 examples
Preprocessed 300 examples
Preprocessed 400 examples
Preprocessed 500 examples
Preprocessed 600 examples
Preprocessed 700 examples
Preprocessed 800 examples
Preprocessed 900 examples
Preprocessed 1000 examples
Preprocessed 1100 examples
Preprocessed 1200 examples
Preprocessed 1300 examples
Preprocessed 1400 examples
Preprocessed 1500 examples
Preprocessed 1600 examples
Preprocessed 1700 examples
Preprocessed 1800 examples
Preprocessed 1900 examples
Preprocessed 2000 examples
Preprocessed 2100 examples
Preprocessed 2200 examples
Preprocessed 2300 examples
Preprocessed 2400 examples
Preprocessed 2500 examples
Preprocessed 2600 examples
Preprocessed 2700 examples
Preprocessed 2800 examples
Preprocessed 2900 examples
Preprocessed 3000 examples
Preprocessed 3100 examples
Preprocessed 3200 examples
Preprocessed 3300 examples
Preprocessed 3400 examples
Preprocessed 3500 examples
Preprocessed 3600 examples
Preprocessed 3700 examples
Preprocessed 3800 examples
Preprocessed 3900 examples
Preprocessed 4000 examples
Preprocessed 4100 examples
Preprocessed 4200 examples
Preprocessed 4300 examples
Preprocessed 4400 examples
Preprocessed 4500 examples
Preprocessed 4600 examples
Preprocessed 4700 examples
Preprocessed 4800 examples
Preprocessed 4900 examples
Preprocessed 5000 examples
Preprocessed 5100 examples
Preprocessed 5200 examples
Preprocessed 5300 examples
Preprocessed 5400 examples
Preprocessed 5500 examples
Preprocessed 5600 examples
Preprocessed 5700 examples
Preprocessed 5800 examples
Preprocessed 5900 examples
Preprocessed 6000 examples
Preprocessed 6100 examples
Preprocessed 6200 examples
Preprocessed 6300 examples
Preprocessed 6400 examples
Preprocessed 6500 examples
Preprocessed 6600 examples
Preprocessed 6700 examples
Preprocessed 6800 examples
Preprocessed 6900 examples
Preprocessed 7000 examples
Preprocessed 7100 examples
Preprocessed 7200 examples
Preprocessed 7300 examples
Preprocessed 7400 examples
Preprocessed 7500 examples
Preprocessed 7600 examples
Preprocessed 7700 examples
Preprocessed 7800 examples
Preprocessed 7900 examples
Preprocessed 8000 examples
Preprocessed 8100 examples
Preprocessed 8200 examples
Preprocessed 8300 examples
Preprocessed 8400 examples
Preprocessed 8500 examples
Preprocessed 8600 examples

In [36]:
with open("/ai/conceptflow/data/examples/semantic-parsing/text-to-sql/spider/spider/dev.json") as train:
    train_data = json.load(train)
    with open('/ai/conceptflow/relogic-semparse/data/spider/preprocessed_dev.json', 'w') as output_file:
        for i, example in enumerate(train_data):
            if i % 500 == 0:
                print ('Preprocessed {0} examples'.format(i))
            sql = example['query']
            question = example['question']
            translated_sql, translated_struct_sql = translate_sql(sql)

            data = {
                "sql" : sql,
                "translated_sql" : translated_sql,
                "translated_struct_sql" : translated_struct_sql,
                "question" : question
            }
            
            output_file.write(json.dumps(data) + '\n')

Preprocessed 0 examples
Preprocessed 500 examples
Preprocessed 1000 examples

In [34]:
import json
from torch.utils.data import WeightedRandomSampler
import time

sql_translated = {}
with open("/ai/conceptflow/relogic-semparse/data/spider/preprocessed_train.json") as f:
    for line in f:
        example = json.loads(line)
        sql = example['sql']
        translated_sql = example['translated_sql']
        if sql not in sql_translated:
            sql_translated[sql] = translated_sql
        

with open("/ai/conceptflow/relogic-semparse/data/spider/AdvEval_augmented_train.json") as f:
    with open("/ai/conceptflow/relogic-semparse/data/spider_eval/train.json", 'w') as out_f:
        for i, line in enumerate(f):
            if i % 500 == 0:
                print('preprocesed:', i)
            example = json.loads(line)
            sql = example['sql'].strip(';')
            translated_sql = sql_translated[sql]
            question = example['pos'][0]
            
            #positive sample
            pos_eval_example = {
                'sql' : sql,
                'translated_sql' : translated_sql,
                'question': question,
                'label' : 1,
                'remark' : 'positive'
            }
            out_f.write(json.dumps(pos_eval_example) + '\n')
            
            #negative sample
            example["neg_question"] = [q for q in example["neg_question"] if q != question]
            neg_questions = example["neg_question"] + example["neg_temp"]
            weights = [0.8] * len(example["neg_question"]) + [0.4] * len(example["neg_temp"])
            
            neg_question_sample_index = list(WeightedRandomSampler(weights, 10, replacement=True))
            neg_questions = [neg_questions[i] for i in neg_question_sample_index]
            for neg_question in neg_questions:
                neg_eval_example = {
                    'sql' : sql,
                    'translated_sql' : translated_sql,
                    'question': neg_question,
                    'label' : 0,
                    'remark' : 'negative'
                }
                out_f.write(json.dumps(neg_eval_example) + '\n')

preprocesed: 0
preprocesed: 500
preprocesed: 1000
preprocesed: 1500
preprocesed: 2000
preprocesed: 2500
preprocesed: 3000
preprocesed: 3500
preprocesed: 4000
preprocesed: 4500
preprocesed: 5000
preprocesed: 5500
preprocesed: 6000
preprocesed: 6500
preprocesed: 7000
preprocesed: 7500
preprocesed: 8000
preprocesed: 8500

In [7]:
import json
import csv


neg_stat = {}
count = 1
with open("/ai/conceptflow/relogic-semparse/data/spider_eval/dev_v2.json", 'w') as out_f:
    with open("/ai/conceptflow/relogic-semparse/data/spider/preprocessed_dev.json") as f:
        for line in f:
            example = json.loads(line)
            sql = example['sql']
            translated_struct_sql = example['translated_struct_sql']
            question = example['question']            
            pos_eval_example = {
                'sql' : sql,
                'translated_sql' : translated_struct_sql,
                'question': question,
                'label' : 1,
                'remark' : 'positive'
            }
            
            out_f.write(json.dumps(pos_eval_example) + '\n')
            
    with open("/ai/conceptflow/relogic-semparse/data/eval/AdvEval_negatives.csv", encoding='utf8') as adv_neg:
        f_csv = csv.reader(adv_neg)
        for i, line in enumerate(f_csv):
            if i == 0:
                continue
            if i %100 == 0:
                print('preprocesed:', i)
            sql = line[0].strip(';')
            #translated_sql = sql_translated[sql]
            neg_question = line[2]
            remark = line[3]
            
            if not remark:
                print (i + 1)
                
            if remark not in neg_stat:
                neg_stat[remark] = 1
            else:
                neg_stat[remark] += 1
            
            translated_sql, translated_struct_sql = translate_sql(sql)
            print(sql)
            print(translated_struct_sql)
            
            
            neg_eval_example = {
                'sql' : sql,
                'translated_sql' : translated_struct_sql,
                'question': neg_question,
                'label' : 0,
                'remark' : remark.lower()
            }
            
            out_f.write(json.dumps(neg_eval_example) + '\n')
            
    
print(neg_stat)

SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)
( name ) that belongs to ( shop ) , that have ( ( number products ) greater than ( the average of ( number products ) ) that belongs to ( shop ) )
SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING count(*)  <  3
( template type code ) that belongs to ( templates ) , grouped by ( template type code ) , that have ( ( the number of ( all items ) ) less than ( 3 ) )
SELECT state FROM Owners INTERSECT SELECT state FROM Professionals
( state ) that belongs to ( owners ), and intersect with ( ( state ) that belongs to ( professionals ))
SELECT max(charge_amount) FROM Charges
( the maximum of ( charge amount ) ) that belongs to ( charges )
SELECT Name FROM country WHERE SurfaceArea  >  (SELECT min(SurfaceArea) FROM country WHERE Continent  =  "Europe")
( name ) that belongs to ( country ) , that have ( ( surfacearea ) greater than ( the minimum of ( surfacearea ) ) that belongs to ( country ) , that have ( ( continent ) equal to ( europe ) ) )
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
( name ) that belongs to ( stadium ) , that have ( ( stadium_id ) not in ( ( stadium id ) that belongs to ( concert ) ) )
SELECT state FROM Owners INTERSECT SELECT state FROM Professionals
( state ) that belongs to ( owners ), and intersect with ( ( state ) that belongs to ( professionals ))
SELECT T1.course_name ,  T1.course_id FROM Courses AS T1 JOIN Sections AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_id HAVING count(*)  <=  2
( course name of likes ) , ( course id of likes ) that belongs to ( ( courses ) , and ( ( sections ) satisfied that ( ( course id of likes ) equal to ( course id of highschooler ) ) ) ) , grouped by ( course id of likes ) , that have ( ( the number of ( all items ) ) less than or equal to ( 2 ) )
SELECT line_1 ,  line_2 FROM addresses
( line 1 ) , ( line 2 ) that belongs to ( addresses )
SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
( abbreviation ) that belongs to ( airlines ) , that have ( ( airline ) equal to ( jetblue airways ) )
SELECT Orchestra FROM orchestra WHERE Orchestra_ID NOT IN (SELECT Orchestra_ID FROM performance)
( orchestra ) that belongs to ( orchestra ) , that have ( ( orchestra_id ) not in ( ( orchestra id ) that belongs to ( performance ) ) )
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1
( name of employee ) that belongs to ( ( employee ) , and ( ( evaluation ) satisfied that ( ( employee id of employee ) equal to ( employee id of evaluation ) ) ) ) , ordered by ( ( bonus of evaluation ) in descending order ) , limited to the top ( 1 )
SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name
( name of highschooler ) , ( the number of ( all items ) ) that belongs to ( ( course arrange ) , and ( ( teacher ) satisfied that ( ( teacher id of likes ) equal to ( teacher id of highschooler ) ) ) ) , grouped by ( name of highschooler )
SELECT avg(winner_rank) FROM matches
( the average of ( winner rank ) ) that belongs to ( matches )
SELECT count(DISTINCT GovernmentForm) FROM country WHERE Continent  =  "Africa"
( the number of ( distinct ( governmentform ) ) ) that belongs to ( country ) , that have ( ( continent ) equal to ( africa ) )
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
( weight ) that belongs to ( pets ) , ordered by ( ( pet age ) ) , limited to the top ( 1 )
SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"
( airportcode ) , ( airportname ) that belongs to ( airports ) , that have ( ( city ) equal to ( anthony ) )
SELECT count(DISTINCT winner_name) FROM matches WHERE tourney_name  =  'WTA Championships' AND winner_hand  =  'L'
( the number of ( distinct ( winner name ) ) ) that belongs to ( matches ) , that have ( ( ( tourney name ) equal to ( 'wta championships' ) ) and ( ( winner hand ) equal to ( 'l' ) ) )
SELECT Episode FROM TV_series ORDER BY rating
( episode ) that belongs to ( tv series ) , ordered by ( ( rating ) )
SELECT count(*) ,  YEAR FROM matches GROUP BY YEAR
( the number of ( all items ) ) , ( year ) that belongs to ( matches ) , grouped by ( year )
SELECT T3.area_code FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number JOIN area_code_state AS T3 ON T2.state  =  T3.state WHERE T1.contestant_name  =  'Tabatha Gehling' INTERSECT SELECT T3.area_code FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number JOIN area_code_state AS T3 ON T2.state  =  T3.state WHERE T1.contestant_name  =  'Kelly Clauss'
( area code of area code state ) that belongs to ( ( contestants ) , and ( ( votes ) satisfied that ( ( contestant number of likes ) equal to ( contestant number of highschooler ) ) ) , and ( ( area code state ) satisfied that ( ( state of highschooler ) equal to ( state of area code state ) ) ) ) , that have ( ( contestant name of likes ) equal to ( 'tabatha gehling' ) ), and intersect with ( ( area code of area code state ) that belongs to ( ( contestants ) , and ( ( votes ) satisfied that ( ( contestant number of likes ) equal to ( contestant number of highschooler ) ) ) , and ( ( area code state ) satisfied that ( ( state of highschooler ) equal to ( state of area code state ) ) ) ) , that have ( ( contestant name of likes ) equal to ( 'kelly clauss' ) ))
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
( country ) that belongs to ( singer ) , that have ( ( age ) greater than ( 40 ) ), and intersect with ( ( country ) that belongs to ( singer ) , that have ( ( age ) less than ( 30 ) ))
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
( major ) , ( age ) that belongs to ( student ) , that have ( ( stuid ) not in ( ( stuid of likes ) that belongs to ( ( student ) , and ( ( has pet ) satisfied that ( ( stuid of likes ) equal to ( stuid of highschooler ) ) ) , and ( ( pets ) satisfied that ( ( petid of area code state ) equal to ( petid of highschooler ) ) ) ) , that have ( ( pettype of area code state ) equal to ( 'cat' ) ) ) )
SELECT T1.Abbreviation ,  T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) LIMIT 1
( abbreviation of likes ) , ( country of likes ) that belongs to ( ( airlines ) , and ( ( flights ) satisfied that ( ( uid of likes ) equal to ( airline of highschooler ) ) ) ) , grouped by ( airline of likes ) , ordered by ( ( the number of ( all items ) ) ) , limited to the top ( 1 )
SELECT Name ,  SurfaceArea FROM country ORDER BY SurfaceArea DESC LIMIT 5
( name ) , ( surfacearea ) that belongs to ( country ) , ordered by ( ( surfacearea ) in descending order ) , limited to the top ( 5 )
SELECT Name FROM country WHERE Continent  =  "Africa"  AND population  <  (SELECT min(population) FROM country WHERE Continent  =  "Asia")
( name ) that belongs to ( country ) , that have ( ( ( continent ) equal to ( africa ) ) and ( ( population ) less than ( the minimum of ( population ) ) that belongs to ( country ) , that have ( ( continent ) equal to ( asia ) ) ) )
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
( the number of ( all items ) ) that belongs to ( ( flights ) , and ( ( airports ) satisfied that ( ( sourceairport of likes ) equal to ( airportcode of highschooler ) ) ) ) , that have ( ( city of highschooler ) equal to ( aberdeen ) )
SELECT DISTINCT T1.Region FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" OR T2.Language  =  "Dutch"
( distinct ( region of likes ) ) that belongs to ( ( country ) , and ( ( countrylanguage ) satisfied that ( ( code of likes ) equal to ( countrycode of highschooler ) ) ) ) , that have ( ( ( language of highschooler ) equal to ( english ) ) or ( ( language of highschooler ) equal to ( dutch ) ) )
SELECT T2.created ,  T2.state ,  T2.phone_number FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number WHERE T1.contestant_name  =  'Tabatha Gehling'
( created of highschooler ) , ( state of highschooler ) , ( phone number of highschooler ) that belongs to ( ( contestants ) , and ( ( votes ) satisfied that ( ( contestant number of likes ) equal to ( contestant number of highschooler ) ) ) ) , that have ( ( contestant name of likes ) equal to ( 'tabatha gehling' ) )
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1
( model of likes ) that belongs to ( ( car names ) , and ( ( cars data ) satisfied that ( ( makeid of likes ) equal to ( id of highschooler ) ) ) ) , ordered by ( ( horsepower of highschooler ) in ascending order ) , limited to the top ( 1 )
SELECT count(*) FROM Transcripts
( the number of ( all items ) ) that belongs to ( transcripts )
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*) BETWEEN 1 AND 2
( document id ) that belongs to ( paragraphs ) , grouped by ( document id ) , that have ( ( the number of ( all items ) ) between ( 1 ) and ( 2 ) )
SELECT T1.treatment_type_description FROM Treatment_types AS T1 JOIN Treatments AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code GROUP BY T1.treatment_type_code ORDER BY sum(cost_of_treatment) ASC LIMIT 1
( treatment type description of likes ) that belongs to ( ( treatment types ) , and ( ( treatments ) satisfied that ( ( treatment type code of likes ) equal to ( treatment type code of highschooler ) ) ) ) , grouped by ( treatment type code of likes ) , ordered by ( ( the sum of ( cost of treatment ) ) in ascending order ) , limited to the top ( 1 )
SELECT count(*) FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
( the number of ( all items ) ) that belongs to ( ( likes ) , and ( ( highschooler ) satisfied that ( ( student id of likes ) equal to ( id of highschooler ) ) ) ) , that have ( ( name of highschooler ) equal to ( kyle ) )
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"
( the number of ( all items ) ) that belongs to ( ( flights ) , and ( ( airports ) satisfied that ( ( destairport of likes ) equal to ( airportcode of highschooler ) ) ) , and ( ( airlines ) satisfied that ( ( uid of area code state ) equal to ( airline of likes ) ) ) ) , that have ( ( ( city of highschooler ) equal to ( aberdeen ) ) and ( ( airline of area code state ) equal to ( united airlines ) ) )
SELECT student_id FROM Friend INTERSECT SELECT liked_id FROM Likes
( student id ) that belongs to ( friend ), and intersect with ( ( liked id ) that belongs to ( likes ))
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.DestAirport  =  "AHD"
( airline of likes ) that belongs to ( ( airlines ) , and ( ( flights ) satisfied that ( ( uid of likes ) equal to ( airline of highschooler ) ) ) ) , that have ( ( destairport of highschooler ) equal to ( ahd ) )
SELECT contestant_number ,  contestant_name FROM contestants ORDER BY contestant_name DESC
( contestant number ) , ( contestant name ) that belongs to ( contestants ) , ordered by ( ( contestant name ) in descending order )
SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1
( name of evaluation ) that belongs to ( ( hiring ) , and ( ( shop ) satisfied that ( ( shop id of employee ) equal to ( shop id of evaluation ) ) ) ) , grouped by ( shop id of employee ) , ordered by ( ( the number of ( all items ) ) in descending order ) , limited to the top ( 1 )
SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5
( version number ) , ( template type code ) that belongs to ( templates ) , that have ( ( version number ) greater than ( 5 ) )
SELECT count(*) FROM pets WHERE weight  >  10
( the number of ( all items ) ) that belongs to ( pets ) , that have ( ( weight ) greater than ( 10 ) )
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
( song name ) that belongs to ( singer ) , that have ( ( age ) greater than ( the average of ( age ) ) that belongs to ( singer ) )
SELECT count(*) FROM Courses
( the number of ( all items ) ) that belongs to ( courses )
SELECT T1.date_of_treatment ,  T2.first_name FROM Treatments AS T1 JOIN Professionals AS T2 ON T1.professional_id  =  T2.professional_id
( date of treatment of likes ) , ( first name of highschooler ) that belongs to ( ( treatments ) , and ( ( professionals ) satisfied that ( ( professional id of likes ) equal to ( professional id of highschooler ) ) ) )
SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
( the number of ( all items ) ) , ( directed by ) that belongs to ( cartoon ) , grouped by ( directed by )
SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid)
( the average of ( age ) ) that belongs to ( student ) , that have ( ( stuid ) not in ( ( stuid of likes ) that belongs to ( ( student ) , and ( ( has pet ) satisfied that ( ( stuid of likes ) equal to ( stuid of highschooler ) ) ) ) ) )
SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code
( template type code ) , ( the number of ( all items ) ) that belongs to ( templates ) , grouped by ( template type code )
SELECT count(DISTINCT current_address_id) FROM Students
( the number of ( distinct ( current address id ) ) ) that belongs to ( students )
SELECT count(*) FROM AIRLINES
( the number of ( all items ) ) that belongs to ( airlines )
SELECT Name FROM country WHERE continent  =  "Europe" AND Population  =  "80000"
( name ) that belongs to ( country ) , that have ( ( ( continent ) equal to ( europe ) ) and ( ( population ) equal to ( 80000 ) ) )
SELECT T1.owner_id ,  T2.first_name ,  T2.last_name FROM Dogs AS T1 JOIN Owners AS T2 ON T1.owner_id  =  T2.owner_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
( owner id of likes ) , ( first name of highschooler ) , ( last name of highschooler ) that belongs to ( ( dogs ) , and ( ( owners ) satisfied that ( ( owner id of likes ) equal to ( owner id of highschooler ) ) ) ) , grouped by ( owner id of likes ) , ordered by ( ( the number of ( all items ) ) in descending order ) , limited to the top ( 1 )
SELECT Population ,  Region FROM country WHERE Name  =  "Angola"
( population ) , ( region ) that belongs to ( country ) , that have ( ( name ) equal to ( angola ) )
SELECT Name FROM singer WHERE Birth_Year  =  1948 OR Birth_Year  =  1949
( name ) that belongs to ( singer ) , that have ( ( ( birth year ) equal to ( 1948 ) ) or ( ( birth year ) equal to ( 1949 ) ) )
SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009
( the average of ( num of staff ) ) that belongs to ( museum ) , that have ( ( open year ) less than ( 2009 ) )
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID HAVING COUNT(*)  >  1
( name of likes ) that belongs to ( ( conductor ) , and ( ( orchestra ) satisfied that ( ( conductor id of likes ) equal to ( conductor id of highschooler ) ) ) ) , grouped by ( conductor id of highschooler ) , that have ( ( the number of ( all items ) ) greater than ( 1 ) )
SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'
( fname of likes ) that belongs to ( ( student ) , and ( ( has pet ) satisfied that ( ( stuid of likes ) equal to ( stuid of highschooler ) ) ) , and ( ( pets ) satisfied that ( ( petid of area code state ) equal to ( petid of highschooler ) ) ) ) , that have ( ( pettype of area code state ) equal to ( 'cat' ) ), and intersect with ( ( fname of likes ) that belongs to ( ( student ) , and ( ( has pet ) satisfied that ( ( stuid of likes ) equal to ( stuid of highschooler ) ) ) , and ( ( pets ) satisfied that ( ( petid of area code state ) equal to ( petid of highschooler ) ) ) ) , that have ( ( pettype of area code state ) equal to ( 'dog' ) ))
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
( the average of ( age ) ) , ( the minimum of ( age ) ) , ( the maximum of ( age ) ) that belongs to ( singer ) , that have ( ( country ) equal to ( 'france' ) )
SELECT Name FROM singer WHERE Citizenship != "France"
( name ) that belongs to ( singer ) , that have ( ( citizenship ) not equal to ( france ) )
SELECT Name FROM conductor ORDER BY Year_of_Work DESC
( name ) that belongs to ( conductor ) , ordered by ( ( year of work ) in descending order )
SELECT FlightNo FROM FLIGHTS WHERE SourceAirport  =  "APG"
( flightno ) that belongs to ( flights ) , that have ( ( sourceairport ) equal to ( apg ) )
SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING count(*)  <  3
( template type code ) that belongs to ( templates ) , grouped by ( template type code ) , that have ( ( the number of ( all items ) ) less than ( 3 ) )
SELECT Name FROM people WHERE Nationality != "Russia"
( name ) that belongs to ( people ) , that have ( ( nationality ) not equal to ( russia ) )
SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)
( name ) that belongs to ( teacher ) , that have ( ( teacher_id ) not in ( ( teacher id ) that belongs to ( course arrange ) ) )
SELECT T1.owner_id ,  T1.zip_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY sum(T3.cost_of_treatment) DESC LIMIT 1
( owner id of likes ) , ( zip code of likes ) that belongs to ( ( owners ) , and ( ( dogs ) satisfied that ( ( owner id of likes ) equal to ( owner id of highschooler ) ) ) , and ( ( treatments ) satisfied that ( ( dog id of highschooler ) equal to ( dog id of area code state ) ) ) ) , grouped by ( owner id of likes ) , ordered by ( ( the sum of ( cost of treatment of area code state ) ) in descending order ) , limited to the top ( 1 )
SELECT max(area_code) ,  min(area_code) FROM area_code_state
( the maximum of ( area code ) ) , ( the minimum of ( area code ) ) that belongs to ( area code state )
SELECT count(*) FROM employee
( the number of ( all items ) ) that belongs to ( employee )
SELECT mpg FROM CARS_DATA WHERE Cylinders  =  8 OR YEAR  <  1980 ORDER BY mpg DESC LIMIT 1
( mpg ) that belongs to ( cars data ) , that have ( ( ( cylinders ) equal to ( 8 ) ) or ( ( year ) less than ( 1980 ) ) ) , ordered by ( ( mpg ) in descending order ) , limited to the top ( 1 )
SELECT name FROM battle WHERE bulgarian_commander  =  'Kaloyan' AND latin_commander  =  'Baldwin I'
( name ) that belongs to ( battle ) , that have ( ( ( bulgarian commander ) equal to ( 'kaloyan' ) ) and ( ( latin commander ) equal to ( 'baldwin i' ) ) )
SELECT name ,  date FROM battle
( name ) , ( date ) that belongs to ( battle )
SELECT LANGUAGE FROM countrylanguage GROUP BY LANGUAGE ORDER BY count(*) DESC LIMIT 1
( language ) that belongs to ( countrylanguage ) , grouped by ( language ) , ordered by ( ( the number of ( all items ) ) in descending order ) , limited to the top ( 1 )
SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T1.Model  =  'volvo'

In [ ]:
from tqdm import tqdm

import json
import random

sql_mutation = {}

with open('/ai/conceptflow/relogic-semparse/data/sql_mutation/spider_train_mutation.json', encoding='utf-8') as f:
    for line in f:
        mutation = json.loads(line)
        sql = mutation['sql']
        mutated_sql = mutation['mutated_sql']
        if sql not in sql_mutation:
            if len(mutated_sql) >= 3:
                sql_mutation[sql] = random.sample(mutated_sql, 3)
            else:
                sql_mutation[sql] = mutated_sql


with open("/ai/conceptflow/data/examples/semantic-parsing/text-to-sql/spider/spider/train.json") as train:
    train_data = json.load(train)
    with open('/ai/conceptflow/relogic-semparse/data/sql_mutation/preprocessed_spider_train.json', 'w') as output_file:
        for example in tqdm(train_data):
            original_sql = example['query']
            mutated_sqls = sql_mutation[original_sql]
            sql = example['query']
            #question = example['question']
            _, translated_struct_original_sql = translate_sql(sql)
            
            for mutated_sql in mutated_sqls:

                #print(sql)
                try:
                    translated_sql, translated_struct_sql = translate_sql(mutated_sql)

                    data = {"sql": mutated_sql, 
                            "translated_sql": translated_sql,
                            "translated_struct_sql": translated_struct_sql,
                            "question": translated_struct_original_sql}

                    output_file.write(json.dumps(data) + '\n')
                except:
                    continue

  1%|▏         | 117/8659 [01:15<1:00:42,  2.34it/s]